#1. Поработайте с переменными, создайте несколько, выведите на экран, запросите у пользователя несколько чисел и строк и
# сохраните в переменные, выведите на экран.

name = input("Как Вас зовут? ")
surname = input("Какая у Вас фамилия? ")
age = input("Сколько Вам лет? ")

print(f'Привет, {name} {surname}! Тебе {age} лет. Я все о тебе знаю!')

#2. Пользователь вводит время в секундах. Переведите время в часы, минуты и секунды и выведите в формате чч:мм:сс.
#Используйте форматирование строк.

time = input("Введите время в секундах: ")
time = int(time)

days = time // (60 * 60 * 24)
hours = (time - days*60*60*24) // (60 * 60)
minutes = (time - days*60*60*24 - hours*60*60) // 60
seconds = (time - days*60*60*24 - hours*60*60 - minutes*60)

print(f'В формате чч:мм:сс введенное время в секундах равно: {days} д. {hours}:{minutes}:{seconds}')

#3. Узнайте у пользователя число n. Найдите сумму чисел n + nn + nnn. Например, пользователь ввёл число 3.
# Считаем 3 + 33 + 333 = 369.

a = input("Введите целое положительное число n: ")
n = int(a)
nn = int(a + a)
nnn = int(a + a + a)

print(f'Сумма чисел вида n + nn + nnn равна {n + nn + nnn}')

# 4. Пользователь вводит целое положительное число. Найдите самую большую цифру в числе. Для решения используйте цикл while и
# арифметические операции.

a = input("Введите целое положительное число: ")
a = int(a)

if a <= 0:
    print("Введенное число не является положительным")
else:
    modulo = []
    while a >= 10:
        b = a % 10
        modulo.append(b)
        a = a // 10

print(f'Самая большая цифра введенного числа {max(modulo)}')

# 5. Запросите у пользователя значения выручки и издержек фирмы. Определите, с каким финансовым результатом работает фирма
# (прибыль — выручка больше издержек, или убыток — издержки больше выручки). Выведите соответствующее сообщение. Если фирма
# отработала с прибылью, вычислите рентабельность выручки (соотношение прибыли к выручке). Далее запросите численность
# сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.

gain = input("Для анализа финансового результат Вашей фирмы, введите, пожалуйста, значение выручки за последний месяц: ")
costs = input(
    "Для анализа финансового результат Вашей фирмы, введите, пожалуйста, значение издержек за последний месяц: ")

gain = int(gain)
costs = int(costs)

if gain - costs > 0:
    profit = (gain - costs) / gain
    print('За последний месяц Ваша фирма отработала с прибылью')
    print(f'Показатель "Рентабельность выручки" составляет: {profit}')

    employees = input("Введите численность сотрудников фирмы:")
    employees = int(employees)
    profit_for_emp = (gain - costs) / employees
    print(f'Прибыль фирмы в расчете на одного сотрудника составляет: {profit_for_emp}')

elif gain == costs:
    print('Ваша фирма ничего не заработала, но и ничего не потеряла')
else:
    print('За последний месяц Ваша фирма отработала с убытком')

# 6. Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров. Каждый день спортсмен
# увеличивал результат на 10 % относительно предыдущего. Требуется определить номер дня, на который общий результат спортсмена
# составить не менее b километров. Программа должна принимать значения параметров a и b и выводить одно натуральное число —
# номер дня.

a = input("Введите количество километров, которые пробежал спортсмен в первый день своей пробежки: ")
b = input(
    "Введите количество километров, которые должен пробежать спортсмен через N дней, увеличивая результат на 10% каждый день: ")

a = float(a)
b = float(b)

n = 1
c = (1 + 0.1)

while a * (c ** n) < b:
    n = n + 1

print(f'Спортсмен достигнет этого результата через {n + 1} дней')
